## 🏗️ Terraform Plan Summary

**Environment:** 🧪 `dev`

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
data.terraform_remote_state.main: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.app["us-central1"] will be created
  + resource "google_cloud_run_v2_service" "app" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "application"                = "agent-foundation"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + labels                  = {
          + "application" = "agent-foundation"
          + "environment" = "dev"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = "GA"
      + location                = "us-central1"
      + name                    = "agent-foundation-dev"
      + observed_generation     = (known after apply)
      + project                 = "doug-hayden-eng-sandbox"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "application"                = "agent-foundation"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling {
          + manual_instance_count = (known after apply)
          + max_instance_count    = 100
          + min_instance_count    = (known after apply)
        }

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN2"
          + max_instance_request_concurrency = 100
          + service_account                  = "agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
          + timeout                          = "300s"

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:8350f64ccd56820705f9443bf7ef1a49c2e106a7f9e8c95c9cd984a01d4575b8"

              + env {
                  + name  = "ADK_SUPPRESS_EXPERIMENTAL_FEATURE_WARNINGS"
                  + value = "TRUE"
                }
              + env {
                  + name  = "AGENT_ENGINE"
                  + value = (known after apply)
                }
              + env {
                  + name  = "AGENT_NAME"
                  + value = "agent-foundation"
                }
              + env {
                  + name  = "ALLOW_ORIGINS"
                  + value = jsonencode(
                        [
                          + "http://127.0.0.1",
                          + "http://127.0.0.1:8000",
                        ]
                    )
                }
              + env {
                  + name  = "ARTIFACT_SERVICE_URI"
                  + value = (known after apply)
                }
              + env {
                  + name  = "GOOGLE_CLOUD_LOCATION"
                  + value = "us-central1"
                }
              + env {
                  + name  = "GOOGLE_CLOUD_PROJECT"
                  + value = "doug-hayden-eng-sandbox"
                }
              + env {
                  + name  = "GOOGLE_GENAI_USE_VERTEXAI"
                  + value = "TRUE"
                }
              + env {
                  + name  = "LOG_LEVEL"
                  + value = "DEBUG"
                }
              + env {
                  + name  = "OTEL_INSTRUMENTATION_GENAI_CAPTURE_MESSAGE_CONTENT"
                  + value = "TRUE"
                }
              + env {
                  + name  = "RELOAD_AGENTS"
                  + value = "FALSE"
                }
              + env {
                  + name  = "ROOT_AGENT_MODEL"
                  + value = "gemini-2.5-flash"
                }
              + env {
                  + name  = "SERVE_WEB_INTERFACE"
                  + value = "TRUE"
                }
              + env {
                  + name  = "TELEMETRY_NAMESPACE"
                  + value = "dev"
                }

              + ports {
                  + container_port = 8000
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle = true
                  + limits   = {
                      + "cpu"    = "1"
                      + "memory" = "2Gi"
                    }
                }

              + startup_probe {
                  + failure_threshold     = 5
                  + initial_delay_seconds = 20
                  + period_seconds        = 20
                  + timeout_seconds       = 15

                  + http_get {
                      + path = "/health"
                      + port = 8000
                    }
                }
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

  # google_project_iam_member.app["roles/aiplatform.user"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/aiplatform.user"
    }

  # google_project_iam_member.app["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/cloudtrace.agent"
    }

  # google_project_iam_member.app["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/serviceusage.serviceUsageConsumer"
    }

  # google_project_iam_member.app["roles/storage.bucketViewer"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/storage.bucketViewer"
    }

  # google_project_iam_member.app["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.app["roles/telemetry.tracesWriter"] will be created
  + resource "google_project_iam_member" "app" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + project = "doug-hayden-eng-sandbox"
      + role    = "roles/telemetry.tracesWriter"
    }

  # google_service_account.app will be created
  + resource "google_service_account" "app" {
      + account_id   = "agent-foundation-dev"
      + description  = "Service account attached to the agent-foundation-dev Cloud Run service"
      + disabled     = false
      + display_name = "agent-foundation-dev Service Account"
      + email        = "agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "doug-hayden-eng-sandbox"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.artifact_service will be created
  + resource "google_storage_bucket" "artifact_service" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # google_vertex_ai_reasoning_engine.session_and_memory will be created
  + resource "google_vertex_ai_reasoning_engine" "session_and_memory" {
      + create_time  = (known after apply)
      + description  = "Managed Session and Memory Bank Service for the agent-foundation-dev app"
      + display_name = "agent-foundation-dev Sessions and Memory"
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "doug-hayden-eng-sandbox"
      + update_time  = (known after apply)

      + spec {
        }
    }

  # random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + agent_engine                     = (known after apply)
  + agent_name                       = "agent-foundation"
  + artifact_service_uri             = (known after apply)
  + cloud_run_services               = {
      + us-central1 = {
          + latest_ready_revision = (known after apply)
          + update_time           = (known after apply)
          + uri                   = (known after apply)
        }
    }
  + configured_environment_variables = {
      + ADK_SUPPRESS_EXPERIMENTAL_FEATURE_WARNINGS         = "TRUE"
      + AGENT_ENGINE                                       = (known after apply)
      + AGENT_NAME                                         = "agent-foundation"
      + ALLOW_ORIGINS                                      = jsonencode(
            [
              + "http://127.0.0.1",
              + "http://127.0.0.1:8000",
            ]
        )
      + ARTIFACT_SERVICE_URI                               = (known after apply)
      + GOOGLE_CLOUD_LOCATION                              = "us-central1"
      + GOOGLE_CLOUD_PROJECT                               = "doug-hayden-eng-sandbox"
      + GOOGLE_GENAI_USE_VERTEXAI                          = "TRUE"
      + LOG_LEVEL                                          = "DEBUG"
      + OTEL_INSTRUMENTATION_GENAI_CAPTURE_MESSAGE_CONTENT = "TRUE"
      + RELOAD_AGENTS                                      = "FALSE"
      + ROOT_AGENT_MODEL                                   = "gemini-2.5-flash"
      + SERVE_WEB_INTERFACE                                = "TRUE"
      + TELEMETRY_NAMESPACE                                = "dev"
    }
  + deployed_image                   = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:8350f64ccd56820705f9443bf7ef1a49c2e106a7f9e8c95c9cd984a01d4575b8"
  + location                         = "us-central1"
  + project                          = "doug-hayden-eng-sandbox"
  + service_account_email            = "agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com"
  + service_account_roles            = [
      + "roles/aiplatform.user",
      + "roles/cloudtrace.agent",
      + "roles/logging.logWriter",
      + "roles/serviceusage.serviceUsageConsumer",
      + "roles/storage.bucketViewer",
      + "roles/storage.objectUser",
      + "roles/telemetry.tracesWriter",
    ]
  + terraform_state_bucket           = "terraform-state-agent-foundation-dev-d9593b6b"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"
```

</details>

---